In [14]:
import pandas as pd


STOP_TIMES_PATH = "gtfs/stop_times.txt"
stop_times = pd.read_csv(STOP_TIMES_PATH)

In [19]:
example = stop_times[stop_times.trip_id == 17082][["trip_id", "arrival_time", "departure_time", "shape_dist_traveled", "stop_sequence", "stop_id"]]
example

,trip_id,arrival_time,departure_time,shape_dist_traveled,stop_sequence,stop_id
832180,17082,06:54:00,06:54:00,0.0000,1,42572
832181,17082,06:54:21,06:54:21,0.0763,2,2935
832182,17082,07:15:13,07:15:13,4.6725,3,43310
832183,17082,07:16:00,07:16:00,4.8462,4,43274

In [18]:
trips = pd.read_csv("gtfs/trips.txt")
trips[trips.trip_id == 17082]

,route_id,service_id,trip_id,trip_headsign,direction_id,block_id,shape_id
17081,93,4,17082,320 NEW YORK,0,129ML003,1558

In [20]:
(4.8462) / ((6 + 16) / 60)

13.216909090909091

In [21]:
stops = pd.read_csv("gtfs/stops.txt")
stops[stops.stop_id == 43274]

,stop_id,stop_code,stop_name,stop_desc,stop_lat,stop_lon,zone_id
15786,43274,31858,PORT AUTHORITY BUS TERMINAL,NaN,40.756209,-73.991001,0

In [24]:
services = pd.read_csv("gtfs/calendar_dates.txt")
services.groupby("service_id").count().reset_index().sort_values(by="service_id")

    service_id  date  exception_type
0            1    25              25
1            2    26              26
2            3   129             129
3            4   128             128
4            5     1               1
5            6   104             104
6            7    24              24
7            8     3               3
8            9    24              24
9           10     4               4
10          11    15              15
11          12    21              21
12          13    16              16
13          14     2               2
14          15    15              15
15          16    64              64
16          17    79              79
17          18     6               6
18          19     7               7
19          20    31              31

In [25]:
services[services.service_id == 1]

    service_id      date  exception_type
0            1  20230729               1
1            1  20230805               1
2            1  20230812               1
3            1  20230819               1
4            1  20230826               1
5            1  20230902               1
6            1  20230909               1
7            1  20230916               1
8            1  20230923               1
9            1  20230930               1
10           1  20231007               1
11           1  20231014               1
12           1  20231021               1
13           1  20231028               1
14           1  20231104               1
15           1  20231111               1
16           1  20231118               1
17           1  20231125               1
18           1  20231202               1
19           1  20231209               1
20           1  20231216               1
21           1  20231223               1
22           1  20231230               1
23           1  20240106               1
24           1  20240113               1